In [1]:
from sqlalchemy import create_engine


engine = create_engine('mysql+pyodbc://telecom')
%load_ext sql
%sql engine
%config SqlMagic.autopandas = True

Found pyproject.toml from '/Users/jacky/github/telecom'

# Example Users Information

In [2]:
%sql SHOW TABLES

Running query in 'mysql+pyodbc://telecom'

10 rows affected.

            Tables_in_telecom
0                    cinfo_xy
1         sample_sight_201308
2          sample_user_201308
3  serv_acct_item_0838_201308
4  serv_acct_item_0838_201406
5     tb_asz_cdma_0838_201308
6     tb_asz_cdma_0838_201406
7                       tower
8                tower_center
9            tower_hot_201308

## Terminology
- [CDMA](https://www.techtarget.com/searchnetworking/definition/CDMA-Code-Division-Multiple-Access#:~:text=CDMA%20\(Code%2DDivision%20Multiple%20Access\)%20refers%20to%20any%20of,the%20use%20of%20available%20bandwidth.): Code-division multiple access
- [CDMA2000](https://zh.wikipedia.org/zh-tw/CDMA2000)
- [EVDO](https://en.wikipedia.org/wiki/Evolution-Data_Optimized): Evolution-Data Optimized
- ONEX: 1X

- ARPU: monthly average revenu per unit
- [MOU](https://www.docomo.ne.jp/english/corporate/ir/binary/pdf/library/presentation/060428/p33_e.pdf): miniutes of usage


- table: sample_user_{month}
## column names(keys of table)
| columns | type | explanations | examples | variable name in user_account_information |
| --- | --- | --- | --- | --- | 
| SERV_ID | `varchar(8)` | user ID |  | serv_id |
| MSISDN | `varchar(64)` | cellphone number |  | msisdn |
| [MONTH_NO](#MONTH_NO) | `varchar(6)` | which month |  | month_no |
| CERT_NBR | `varchar(255)` | identity numbr |  | cert_nbr |         
| [CI_BRANCH](#CI_BRANCH) | `varchar(255)` | branch office | 德阳市市辖区, 广汉市 | ci_branch |
| [EMPLOY_FLAG](#flag1) | `int` |  |  | is_zqhy ? | 
| [STUDENT_FLAG](#flag1) | `int` |  |  | is_school ? |  
| [RURAL_FLAG](#flag1) | `int` |  |  | bss_org_zj_flag ? |
| TERMINAL_BRAND | `varchar(255)` | cellphone's brand | SAMSUNG | hs_cdma_brand |
| TERMINAL_MODEL | `varchar(255)` | cellphone's model | SAMSUNG-B189 | hs_cdma_model |
| [TERMINAL_SMART_FLAG](#terminal_info) | `int` | wheter the cellphone is a smartphone |  | is_intelligent |
| [TERMINAL_TYPE](#terminal_info) | `varchar(8)` |  | 1X, 3G | terminal_type |
| [TERMINAL_LEVEL](#terminal_info) | `int` |  | 1,2,3,4,5 | hs_cdma_layer ? |
| [TERMINAL_PRICE](#terminal_info) | `int` | cellphone's price |  | hs_cdma_ter_price |
| HS_CDMA_CT_DATE | `varchar(20)` | when the users start their services? |  | hs_cdma_ct_date |
| [PD_EVDO_FLAG](#speed) | `varchar(1)` | wheter to use EVDO wireless network |  | pd_evdo_flag_m1 |
| [PD_1X_FLAG](#speed) | `varchar(1)` | wheter the use ONEX wireless network |  | pd_1x_flag_m1 |        
| [ARPU](#ARPU) | `float` | user average fee |  | mb_arpu_cdma_m1 | 
| [ARPU_ALL](#ARPU) | `float` | ARPU includes reconciliation |  | mb_arpu_cdma_all_m1 |    
| [CONTRACT_FLAG](#contract) | `varchar(1)` | wheter there is an agreement | | pl_contract_flag |
| [CONTRACT_EXPIRE_MONTH](#contract) | `int` | the number of months due from the agreement |  | pl_expire_month |
| [VO_MOU_LOCAL](#mou) | `float` | MOU of local | 0.45, 28.75, 176.08 | vo_cdma_mouout_local_m1 |
| [VO_MOU_DIST](#mou) | `float` | MOU of long distance | 0, 0.25, 37.55  | vo_cdma_mou_dist_m1 |

In [4]:
%%sql

SELECT
    *
FROM
    sample_user_201308
LIMIT 10;

Running query in 'mysql+pyodbc://telecom'

10 rows affected.

,SERV_ID,MSISDN,MONTH_NO,CERT_NBR,CI_BRANCH,EMPLOY_FLAG,STUDENT_FLAG,RURAL_FLAG,TERMINAL_BRAND,TERMINAL_MODEL,...,TERMINAL_PRICE,HS_CDMA_CT_DATE,PD_EVDO_FLAG,PD_1X_FLAG,ARPU,ARPU_ALL,CONTRACT_FLAG,CONTRACT_EXPIRE_MONTH,VO_MOU_LOCAL,VO_MOU_DIST
0,9uxt3ojw,6m6s3n3s,201308,51-06-26-1981-01-02-1,德阳市市辖区,1,0,0,SAMSUNG,SAMSUNG-N719(3G),...,4890,2013/1/11 10:29:21,1,1,0.000000,0.000000,0,NaN,176.080002,37.549999
1,a2nl3ojo,6twk3n3s,201308,51-06-26-1981-01-02-1,德阳市市辖区,1,0,0,中兴,中兴-N600(3G),...,899,2011/6/11 13:02:54,1,0,0.100000,0.100000,0,NaN,28.750000,0.430000
2,90893o09,mm7pjcxf,201308,51-06-02-1947-06-05-0,德阳市市辖区,1,0,0,华立时代,华立时代-LC101,...,330,2011/6/11 16:02:55,0,0,8.000000,8.000000,0,NaN,11.500000,0.000000
3,8sih3omm,fq5m3q1g,201308,51-06-23-1982-06-08-1,广汉市,1,0,0,SAMSUNG,SAMSUNG-B189,...,299,2012/3/30 8:20:00,0,0,38.000000,38.000000,0,NaN,233.580002,0.250000
4,9v653o8r,mhd8ksuv,201308,51-06-23-1971-11-22-1,中江县,1,0,0,MOTO,MOTO-XT800(3G),...,1180,2012/1/24 9:30:14,1,0,91.610001,91.610001,0,NaN,0.450000,0.000000
5,a2vx3ogx,4kkhjsib,201308,51-06-02-1963-01-30-0,德阳市市辖区,1,0,1,SAMSUNG,SAMSUNG-B309,...,199,2011/6/12 9:23:47,0,0,0.000000,0.000000,0,NaN,13.920000,0.000000
6,980t3oml,iltc4wv5,201308,51-06-02-1974-02-11-1,德阳市市辖区,1,0,0,华为,华为-C8813(3G),...,1090,2013/4/17 23:49:24,1,0,50.000000,6.200000,1,4.0,11.900000,0.000000
7,aie93o5u,efqbk0gj,201308,51-06-25-1959-05-17-0,什邡市,1,0,0,世纪星宇,世纪星宇-V3(3G),...,399,2011/6/12 10:26:52,0,0,10.200000,0.000000,0,NaN,38.680000,0.000000
8,aaoh3o8r,bvdlk0dq,201308,51-06-23-1974-10-17-1,德阳市市辖区,1,0,1,华为,华为-C8500(3G),...,838,2011/6/12 12:18:26,1,0,66.559998,66.559998,0,NaN,40.980000,23.430000
9,aih13o5t,hbvgl0f1,201308,51-06-82-1982-07-05-1,什邡市,1,0,1,中兴,中兴-S160,...,199,2011/6/13 12:22:54,0,0,6.000000,6.000000,0,NaN,31.030001,16.150000

<a name="MONTH_NO"></a>

the coverage of this table is only one month

In [5]:
%%sql

SELECT DISTINCT
    MONTH_NO
FROM
    sample_user_201308

Running query in 'mysql+pyodbc://telecom'

1 rows affected.

  MONTH_NO
0   201308

<a name="CI_BRANCH"></a>

In [6]:
%%sql

SELECT
    CI_BRANCH, COUNT(*) 
FROM
    sample_user_201308 
GROUP BY 
    CI_BRANCH

Running query in 'mysql+pyodbc://telecom'

7 rows affected.

  CI_BRANCH  COUNT(*)
0    德阳市市辖区    130821
1       广汉市     82059
2       中江县     45441
3       什邡市     52252
4       罗江县     18473
5       绵竹市     55347
6  德阳市未知营业区        97

<a name="flag1"></a>

In [7]:
%%sql

SELECT
    EMPLOY_FLAG, COUNT(*) 
FROM
    sample_user_201308 
GROUP BY
    EMPLOY_FLAG

Running query in 'mysql+pyodbc://telecom'

2 rows affected.

   EMPLOY_FLAG  COUNT(*)
0            1    381931
1            0      2559

In [8]:
%%sql

SELECT
    STUDENT_FLAG, COUNT(*) 
FROM
    sample_user_201308 
GROUP BY
    STUDENT_FLAG

Running query in 'mysql+pyodbc://telecom'

2 rows affected.

   STUDENT_FLAG  COUNT(*)
0             0    352969
1             1     31521

In [13]:
%%sql

SELECT
    RURAL_FLAG, COUNT(*) 
FROM
    sample_user_201308 
GROUP BY
    RURAL_FLAG

Running query in 'mysql+pyodbc://telecom'

2 rows affected.

   RURAL_FLAG  COUNT(*)
0           0    232218
1           1    152272

<a name="terminal_info"></a>

In [15]:
%%sql

SELECT
    TERMINAL_SMART_FLAG, COUNT(*) 
FROM
    sample_user_201308 
GROUP BY
    TERMINAL_SMART_FLAG

Running query in 'mysql+pyodbc://telecom'

2 rows affected.

   TERMINAL_SMART_FLAG  COUNT(*)
0                    1    245107
1                    0    139383

In [16]:
%%sql

SELECT
    TERMINAL_TYPE, COUNT(*) 
FROM
    sample_user_201308 
GROUP BY
    TERMINAL_TYPE

Running query in 'mysql+pyodbc://telecom'

2 rows affected.

  TERMINAL_TYPE  COUNT(*)
0            3G    294288
1            1X     90202

In [17]:
%%sql

SELECT
    TERMINAL_LEVEL, COUNT(*) 
FROM
    sample_user_201308 
GROUP BY
    TERMINAL_LEVEL
ORDER BY
    TERMINAL_LEVEL

Running query in 'mysql+pyodbc://telecom'

5 rows affected.

   TERMINAL_LEVEL  COUNT(*)
0               1     80522
1               2    122395
2               3    136266
3               4     33081
4               5     12226

In [18]:
%%sql

SELECT
    MAX(TERMINAL_PRICE), decile
FROM
(
    SELECT
        TERMINAL_PRICE,
        NTILE(10) OVER (ORDER BY TERMINAL_PRICE) AS decile
    FROM
        sample_user_201308
) subquery
GROUP BY
    decile

Running query in 'mysql+pyodbc://telecom'

10 rows affected.

   MAX(TERMINAL_PRICE)  decile
0                  199       1
1                  299       2
2                  399       3
3                  599       4
4                  699       5
5                  838       6
6                  990       7
7                 1090       8
8                 1590       9
9                10600      10

<a name="speed"></a>

In [19]:
%%sql

SELECT
    PD_EVDO_FLAG, COUNT(*) 
FROM
    sample_user_201308 
GROUP BY
    PD_EVDO_FLAG

Running query in 'mysql+pyodbc://telecom'

2 rows affected.

  PD_EVDO_FLAG  COUNT(*)
0            1    224196
1            0    160294

In [20]:
%%sql

SELECT
    PD_1X_FLAG, COUNT(*) 
FROM
    sample_user_201308 
GROUP BY
    PD_1X_FLAG

Running query in 'mysql+pyodbc://telecom'

2 rows affected.

  PD_1X_FLAG  COUNT(*)
0          1     66648
1          0    317842

<a name="ARPU"></a>

In [21]:
%%sql

SELECT
    MAX(ARPU), decile
FROM
(
    SELECT
        ARPU,
        NTILE(10) OVER (ORDER BY ARPU) AS decile
    FROM
        sample_user_201308
) subquery
GROUP BY
    decile

Running query in 'mysql+pyodbc://telecom'

10 rows affected.

     MAX(ARPU)  decile
0     0.000000       1
1     6.000000       2
2    13.500000       3
3    26.000000       4
4    31.000000       5
5    40.000000       6
6    53.000000       7
7    63.500000       8
8    85.660004       9
9  1934.569946      10

In [23]:
%%sql

SELECT
    MAX(ARPU_ALL), decile
FROM
(
     SELECT
        ARPU_ALL,
        NTILE(10) OVER (ORDER BY ARPU_ALL) AS decile
    FROM sample_user_201308
) subquery
GROUP BY
    decile

Running query in 'mysql+pyodbc://telecom'

10 rows affected.

   MAX(ARPU_ALL)  decile
0       0.000000       1
1       0.750000       2
2       7.380000       3
3      16.090000       4
4      26.000000       5
5      34.720001       6
6      43.560001       7
7      59.000000       8
8      74.470001       9
9    1783.939941      10

<a name="contract"></a>

In [24]:
%%sql

SELECT
    CONTRACT_FLAG, COUNT(*) 
FROM
    sample_user_201308 
GROUP BY
    CONTRACT_FLAG

Running query in 'mysql+pyodbc://telecom'

2 rows affected.

  CONTRACT_FLAG  COUNT(*)
0             0    307529
1             1     76961

In [25]:
%%sql

SELECT
    MAX(CONTRACT_EXPIRE_MONTH), quartile
FROM
(
    SELECT
        CONTRACT_EXPIRE_MONTH,
        NTILE(4) OVER (ORDER BY CONTRACT_EXPIRE_MONTH) AS quartile
    FROM
        sample_user_201308
) subquery
GROUP BY
    quartile

Running query in 'mysql+pyodbc://telecom'

4 rows affected.

   MAX(CONTRACT_EXPIRE_MONTH)  quartile
0                         NaN         1
1                         NaN         2
2                         NaN         3
3                        47.0         4

<a name="mou"></a>

In [26]:
%%sql

SELECT
    MAX(VO_MOU_LOCAL), decile
FROM
(
    SELECT
        VO_MOU_LOCAL,
        NTILE(10) OVER (ORDER BY VO_MOU_LOCAL) AS decile
    FROM
        sample_user_201308
) subquery
GROUP BY
    decile

Running query in 'mysql+pyodbc://telecom'

10 rows affected.

   MAX(VO_MOU_LOCAL)  decile
0           0.000000       1
1           0.450000       2
2           4.770000       3
3          12.920000       4
4          25.049999       5
5          42.119999       6
6          66.800003       7
7         106.269997       8
8         185.300003       9
9       11619.799805      10

In [27]:
%%sql

SELECT
    MAX(VO_MOU_DIST), decile
FROM
(
    SELECT
        VO_MOU_DIST,
        NTILE(10) OVER (ORDER BY VO_MOU_DIST) AS decile
    FROM
        sample_user_201308
) subquery
GROUP BY
    decile

Running query in 'mysql+pyodbc://telecom'

10 rows affected.

   MAX(VO_MOU_DIST)  decile
0          0.000000       1
1          0.000000       2
2          0.000000       3
3          0.000000       4
4          0.570000       5
5          3.500000       6
6         10.130000       7
7         24.580000       8
8         62.349998       9
9       8136.399902      10

## More User Information(more complete as well)
*check out table: tb_asz_cdma_0838_{month}*

In [28]:
%%sql

SELECT
    'sample_user_201308' AS table_name,
    COUNT(*) AS count_value
FROM
    sample_user_201308
UNION
SELECT
    'tb_asz_cdma_0838_201308' AS table_name,
    COUNT(*) AS count_value
FROM
    tb_asz_cdma_0838_201308

Running query in 'mysql+pyodbc://telecom'

2 rows affected.

                table_name  count_value
0       sample_user_201308       384490
1  tb_asz_cdma_0838_201308       591218